{
  "backend/main.mo": "Motoko actor defining the cricket scoring backend with types for teams, players, matches, innings, deliveries, and tournament rules, plus stores and auto-incrementing IDs for managing all entities.",
  "feature_evidence.json": "Feature evidence report mapping two features (auto innings-end logic and total score calculation fix) to their relevant frontend files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing key responsibilities and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes and wraps the app in QueryClientProvider and Layout.",
  "frontend/src/components/BatsmanStatsPanel.tsx": "Displays a two-column panel showing runs, balls, fours, sixes, and strike rate for the current striker and non-striker batsmen.",
  "frontend/src/components/BottomTabNavigation.tsx": "Fixed bottom navigation bar with four tabs (History, Teams, Setup, Rules) using TanStack Router Links with active state highlighting.",
  "frontend/src/components/BowlerStatsPanel.tsx": "Displays the current bowler's name, overs bowled, runs conceded, wickets, economy rate, and maidens in a card layout.",
  "frontend/src/components/BulkPlayerUploadModal.tsx": "A multi-step modal dialog for bulk-uploading players to a team via pasted text or file input, with validation (duplicates, length, spacing) and a preview/result flow.",
  "frontend/src/components/ConfigureTournamentRulesModal.tsx": "A modal dialog for viewing and editing tournament rules (overs, penalties, match counts, etc.), loading existing rules and saving updates via React Query mutations.",
  "frontend/src/components/EndOfInningsModal.tsx": "A modal dialog shown at the end of an innings that lets the user select the opening striker, non-striker, and bowler to set up the next innings.",
  "frontend/src/components/EndOfOverModal.tsx": "A modal dialog shown at the end of each over that prompts the user to select the next bowler, excluding the current bowler.",
  "frontend/src/components/Layout.tsx": "The main app shell component rendering a sticky header with logo, bottom tab navigation, a footer, and a content area via React Router's Outlet or children.",
  "frontend/src/components/OverTimeline.tsx": "Displays a visual ball-by-ball timeline for the last three overs, color-coding each delivery by type (wicket, wide, no-ball, boundary, etc.).",
  "frontend/src/components/PlayingElevenSelector.tsx": "A scrollable checklist component for selecting up to 11 players from a squad, disabling further selections once the maximum is reached.",
  "frontend/src/components/QueryErrorState.tsx": "A reusable error state component that displays an appropriate icon, title, and description based on whether the error is infrastructure-related, with optional retry and secondary action buttons.",
  "frontend/src/components/ResetAllDataModal.tsx": "A confirmation alert dialog for resetting all application data, listing what will be deleted and showing a loading spinner during the reset operation.",
  "frontend/src/components/ScoreDisplay.tsx": "A card component that displays the current cricket match score including runs, wickets, overs, and target/required runs for the second innings.",
  "frontend/src/components/WicketModal.tsx": "A dialog modal for recording a wicket dismissal, allowing selection of dismissal type and the next incoming batsman.",
  "frontend/src/data/cricketRules.ts": "Static data file defining categorized cricket rules (Scoring, Extras, Dismissals, etc.) with titles and descriptions, plus a TypeScript interface for TournamentRules.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useMatchState.ts": "Custom React hook that manages cricket match state (innings, batsmen, bowler, over details) with localStorage persistence, BigInt serialization support, and debounced saves.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including teams, matches, deliveries, and tournament rules, using a shared actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for light/dark themes including navy and orange color palettes plus cricket-specific utility classes.",
  "frontend/src/lib/matchStore.ts": "localStorage utility module for persisting match metadata and stored match records, with BigInt-safe JSON serialization helpers and CRUD operations for match entries.",
  "frontend/src/lib/matchUtils.ts": "Pure utility functions for computing cricket statistics (innings totals, batsman stats, bowler stats) from delivery arrays, plus an overs formatting helper.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/LiveScoring.tsx": "Main live scoring page that manages real-time cricket match state, delivery recording, and modals for wickets, end-of-over, and end-of-innings events. Integrates backend queries with local match state via hooks and displays score, batsman/bowler stats, and over timeline.",
  "frontend/src/pages/MatchHistory.tsx": "Displays a list of stored matches with live/completed status badges and provides options to refresh, reset all data, or start a new match. Uses local match store for data and a confirmation modal for the reset action.",
  "frontend/src/pages/MatchSetup.tsx": "Multi-step wizard for configuring a new cricket match, covering team selection, playing 11 squads, toss, match rules, and confirmation. Submits data to the backend via mutations and navigates to live scoring on success.",
  "frontend/src/pages/Rules.tsx": "Displays standard cricket rules and tournament-specific rules in a tabbed accordion layout, with a modal to configure tournament rules. Fetches tournament rules from the backend and shows loading/error states.",
  "frontend/src/pages/Scorecard.tsx": "Shows a detailed post-match or in-progress scorecard for a specific match, computing batting and bowling statistics from deliveries for each innings. Renders innings summaries with batting, bowling tables, and team totals.",
  "frontend/src/pages/Teams.tsx": "React page component for managing cricket teams, supporting listing, adding teams, adding individual players, and bulk player uploads via dialogs and modals.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Inter, Rajdhani), CSS-variable-based color tokens (navy, orange, semantic colors), border radii, box shadows, and keyframe animations.",
  "project_state.json": "Project state metadata for a Cricket Scorer app, tracking existing features, known issues (total score not populating), and two pending action requests for auto-ending innings and fixing score calculation."
}